{
  "tags": {
    "no_tags": {
      "level": "warning",
      "error": "There are no tags for this mix.",
      "instructions": "Open this entry in the CMS and add up to 4 short tags."
    },
    "too_many": {
      "level": "warning",
      "error": "There are too many tags for this mix.",
      "instructions": "Open this entry in the CMS and remove all but the 4 most importants. Please keep it to a maximum of 4."
    }
  },
  "date": {
    "level": "danger",
    "error": "This entry does not have a date set.",
    "instructions": "Open the CMS and please add a date to this entry's field: "
  },
  "missing_image": {
    "level": "danger",
    "error": "This entry does not have its required image.",
    "instructions": "Open the CMS and please add an image to this entry."
  },
  "alt_text": {
    "level": "danger",
    "error": "No alt text specified for this image.",
    "instructions": "Alt text (alternative text) describes an image on a web page and is critically important to set for each image. Open this image in the Media Library and add descriptive text to the alt text field.",
    "moreInfo": "https://ahrefs.com/blog/alt-text/"
  },
  "copyright": {
    "level": "info",
    "error": "No copyright data set.",
    "instructions": "If possible, copyright data should be added to this image (photographer, date, location, etc). Copyright info allows for proper attribution. Open this image in the Media Library and add descriptive text to the copyright field."
  },
  "residents_group_error": {
    "level": "danger",
    "error": "There is a problem with the Residents group field for this entry.",
    "instructions": "Open this entry in the CMS and ensure that all attached Residents are correctly filled out and that there are no gaps ('Add a resident...' messages) in the Residents group field.",
    "moreInfo": [
      {
        "type": "list-item",
        "text": "Check that all attached Residents are correctly filled out.",
        "spans": []
      },
      {
        "type": "list-item",
        "text": "Ensure that there are no gaps ('Add a resident...' messages) in the Residents group field.",
        "spans": [
          { "start": 0, "end": 59, "type": "em" },
          {
            "start": 0,
            "end": 59,
            "type": "hyperlink",
            "data": {
              "link_type": "Web",
              "url": "https://en.wikipedia.org/wiki/Legend_of_the_Black_Shawarma",
              "target": "_blank"
            }
          }
        ]
      }
    ]
  },
  "uid": {},
  "default_error": {
    "error": "This entry does not have a value set for this field.",
    "instructions": "Open the CMS and please fill in this entry's field."
  }
}
